'''此示例示意以文本文件方式读取exercise.py中的数据
'''

def read_text_data():
# <<<---------------------------------->>>
	try:
# <<<---------------------------------->>>
		f = open('exercise.py')
		print('打开文件')		
# <<<---------------------------------->>>
		# F.readline(),返回一行文字
		# while True:
		# 	s = f.readline()	
		# 	if not s:
		# 		print('空白')
		# 		break
		# 	if s[-1]=='\n':
		# 		print('文件内容为:',s[:-1])
		# 	else:
		# 		print('文件内容为:',s)
# <<<---------------------------------->>>		
		# F.readlines(),返回全部文字,获得字符串列表	
		# L = f.readlines()
		# print('所有文字:',L)
# <<<---------------------------------->>>
		# F.read(size),读size个字符,当为负数或则空时,读取全部内容
		s = f.read()
		print(s)
# <<<---------------------------------->>>
		f.close()
# <<<---------------------------------->>>
	except OSError:
		print('打开失败')
# <<<---------------------------------->>>
if __name__ == '__main__':
	read_text_data()