# menu.py

'''选择菜单
'''

# 固定菜单：
def main_menu():
	print('+-----------------------------------------+')
	print('|  1)  添加学生信息                       |')
	print('|  2)  查看学生信息                       |')
	print('|  3)  修改学生信息                       |')
	print('|  4)  删除学生信息                       |')
	print('|  5)  按成绩从高到低打印学生信息         |')
	print('|  6)  按成绩从低到高打印学生信息         |')
	print('|  7)  按年龄从大到小打印学生信息         |')
	print('|  8)  按年龄从小到大打印学生信息         |')
	print('|  9)  保存信息到文件(si.txt)             |')
	print('|  10) 从文件中读取数据(si.txt)           |')
	print('|  q)  退出                               |')
	print('+-----------------------------------------+')

if __name__ == '__main__':
	main_menu()